---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.TorsionalMomentOfInertia
source: html/a56d3647-acea-2676-9c78-e2ae75d31747.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.TorsionalMomentOfInertia Property

Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation

## Syntax (C#)
```csharp
public double TorsionalMomentOfInertia { get; set; }
```